#შექმენით სია, რომელსაც შეინახავთ ცვლადში სახელად friends. მაგ სიაში უნდა შეინახოთ მინიმუმ 5 მეგობრის სახელი. 
# პირველ რიგში გამოიტანეთ თქვენი საუკეთესო მეგობრის სახელი ინდექსების დახმარებით. დაბეჭდეთ სია.\
# შეცვლაეთ მე-3 ინდექსზე მყოფი სახელი ახალით და დაბეჭდეთ სია. საბოლოოდ დაბეჭდეთ მთლიანი სიის სიგრძე

friends = ["luka", "lasha", "gio","andria", "mate"]

#print(friends[0])

friends[3] = "gia"

print(friends[3])

friends = ["luka", "lasha", "gio","andria", "mate"]

lenght = len(friends)
print(lenght)