#შექმენით პროგრამა, სადაც მომხმარებელს შემოატანინებთ სახელს, გვარს და ასაკს, შემოტანილი მნიშვნელობები შეინახეთ ცვლადებში, ცვლადებსა დაარქვით ისეთი სახელები რომელიც შეესაბამება მნიშვნელობებს, აგრეთვე კომენტარებით ახსენით რა არის ფუნქცია + ყველა ხაზი დააკომენტარეთ და ახსენით თითოეულ ხაზზე რას აკეთებთ.
name = input("please enter your first name: ")    #ფუნქცია არის ამ შემთხვევაში არის "name" და  input- ის დახმარებით მომხმარებელს ვთხოვ სახელის შემოტანას
last_name = input("please enter your last name: ") #ფუნქცია არის ამ შემთხვევაში  არის"last_anme" და  input- ის დახმარებით მომხმარებელს ვთხოვ გვარის შემოტანას
age = input("please enter your age: ") #ფუნქცია არის ამ შემთხვევაში არის "age" და  input- ის დახმარებით მომხმარებელს ვთხოვ ასაკის შემოტანას

print(name,last_name,age)