# შექმენით manual_replace ფუნქცია, რომელიც იქნება .replace() ფუნქციის კლონი.
#  ამ ფუნქციამ სთრინგში არსებული sapce-ები უნდა შეცვალოს ტირეებად.
#არ გამოიყენოთ ჩაშენებული ფუნქციები და კომენტარებით ახსენით მე-4 დავალება

def manual_replace(text):
    # შევქმნათ ცარიელი სტრინგი, სადაც შეინახება საბოლოო შედეგი
    result = ""

    # გავიაროთ სტრინგის თითოეული სიმბოლო
    for char in text:
        # თუ სიმბოლო არის space  მას ტირეთი ვცვლით
        if char == " ":
            result += "-"
        else:
            # თუ არაა space, ჩავამატოთ იგივე სიმბოლო
            result += char

    # ვაბრუნებთ მიღებული სტრინგს
    return result


text = "hello world"
print(manual_replace(text))
